
clc; %清除命令窗口的内容，对工作环境中的全部变量无任何影响
clear all; %清除工作空间的所有变量，函数，和MEX文件
%计算小球体积为总体积P(percentage)情况下，随着小球直径的增加，比重的变化曲线。素混凝土密度2.4，陶瓷密度2.5，厚度为1mm。试件直径150mm，高度300mm。

R=(5:1:40); %球体半径为5-40，间隔为1mm
N=QuantityMatrix(75,R); %根据求出最大小球数量
P_MAX=((4*R.^3.*N)/(3*75.^2*300)); %根据体积算出最大百分比，但是考虑到间隙，该情况不可能出现（该程序未使用）
P=(0.2:0.02:0.9); %体积百分比，0.2-0.9，间隔为0.02
[X, Y] = meshgrid(R,P); %产生矩阵

PS=Y.*pi().*75^2*300./(4/3.*pi().*R.^3);%总体积百分数为P的情况下，最大球体个数
DS =2.4-4/3.*PS.*(X.^3.*2.4-(X.^3-(X-1).^3).*2.5)/(75.^2.*300); % 混凝土试件的密度
%mesh(X*2,Y,DS); %绘制3D图像
xlabel('Diemeter'), ylabel('Percentage'), zlabel('Density'),title('Diemeter-Density Graph');grid on;hold on; %3D图形界面设置
%DS =2.4-4/3.*PS.*(X.^3.*2.4-(X.^3-(X-1).^3).*7.8)/(75.^2.*300);
%%混凝土试件密度，中空体材料为铁
%surf(X*2,Y,DS);hold on; %绘制另一种3D图像
%ok=pi().*((X.^2-(X-2).^2)*450-X.^2.*40);
%%计算中空体横截面积承载力是否满足要求（>0）creamics=450,steel=40Mpa
%mesh(R*2,P,ok);
